duckhee/study_stm32/edu_v0.7_cdsdht11/Edu_Shield/LIB_HW/Core/Hw_Regs.h
//-- SPI1
//
#define REG_SPI1_BASE					0x40013000
#define REG_SPI1_CR1					(*(volatile unsigned long *)(REG_SPI1_BASE + 0x0000))
#define REG_SPI1_CR2					(*(volatile unsigned long *)(REG_SPI1_BASE + 0x0004))
#define REG_SPI1_SR						(*(volatile unsigned long *)(REG_SPI1_BASE + 0x0008))
#define REG_SPI1_DR						(*(volatile unsigned long *)(REG_SPI1_BASE + 0x000C))
#define REG_SPI1_CRCPR					(*(volatile unsigned long *)(REG_SPI1_BASE + 0x0010))
#define REG_SPI1_RXCRCR					(*(volatile unsigned long *)(REG_SPI1_BASE + 0x0014))
#define REG_SPI1_TXCRCR					(*(volatile unsigned long *)(REG_SPI1_BASE + 0x0018))
#define REG_SPI1_I2SCFGR				(*(volatile unsigned long *)(REG_SPI1_BASE + 0x001C))
#define REG_SPI1_I2SPR					(*(volatile unsigned long *)(REG_SPI1_BASE + 0x0020))



//-- SPI2
//
#define REG_SPI2_BASE					0x40003800
#define REG_SPI2_CR1					(*(volatile unsigned long *)(REG_SPI2_BASE + 0x0000))
#define REG_SPI2_CR2					(*(volatile unsigned long *)(REG_SPI2_BASE + 0x0004))
#define REG_SPI2_SR						(*(volatile unsigned long *)(REG_SPI2_BASE + 0x0008))
#define REG_SPI2_DR						(*(volatile unsigned long *)(REG_SPI2_BASE + 0x000C))
#define REG_SPI2_CRCPR					(*(volatile unsigned long *)(REG_SPI2_BASE + 0x0010))
#define REG_SPI2_RXCRCR					(*(volatile unsigned long *)(REG_SPI2_BASE + 0x0014))
#define REG_SPI2_TXCRCR					(*(volatile unsigned long *)(REG_SPI2_BASE + 0x0018))
#define REG_SPI2_I2SCFGR				(*(volatile unsigned long *)(REG_SPI2_BASE + 0x001C))
#define REG_SPI2_I2SPR					(*(volatile unsigned long *)(REG_SPI2_BASE + 0x0020))



//-- DMA1
//
#define REG_DMA1_BASE					0x40020000
#define REG_DMA1_ISR					(*(volatile unsigned long *)(REG_DMA1_BASE + 0x0000))
#define REG_DMA1_IFCR					(*(volatile unsigned long *)(REG_DMA1_BASE + 0x0004))
#define REG_DMA1_CCR(x)					(*(volatile unsigned long *)(REG_DMA1_BASE + 0x0008 + 20*((x)-1)))
#define REG_DMA1_CNDTR(x)				(*(volatile unsigned long *)(REG_DMA1_BASE + 0x000C + 20*((x)-1)))
#define REG_DMA1_CPAR(x)				(*(volatile unsigned long *)(REG_DMA1_BASE + 0x0010 + 20*((x)-1)))
#define REG_DMA1_CMAR(x)				(*(volatile unsigned long *)(REG_DMA1_BASE + 0x0014 + 20*((x)-1)))



//-- DMA2
//
#define REG_DMA2_BASE					0x40020400
#define REG_DMA2_ISR					(*(volatile unsigned long *)(REG_DMA2_BASE + 0x0000))
#define REG_DMA2_IFCR					(*(volatile unsigned long *)(REG_DMA2_BASE + 0x0004))
#define REG_DMA2_CCR(x)					(*(volatile unsigned long *)(REG_DMA2_BASE + 0x0008 + 20*((x)-1)))
#define REG_DMA2_CNDTR(x)				(*(volatile unsigned long *)(REG_DMA2_BASE + 0x000C + 20*((x)-1)))
#define REG_DMA2_CPAR(x)				(*(volatile unsigned long *)(REG_DMA2_BASE + 0x0010 + 20*((x)-1)))
#define REG_DMA2_CMAR(x)				(*(volatile unsigned long *)(REG_DMA2_BASE + 0x0014 + 20*((x)-1)))



//-- ADC1
//
#define REG_ADC1_BASE					0x40012400
#define REG_ADC1_SR						(*(volatile unsigned long *)(REG_ADC1_BASE + 0x0000))
#define REG_ADC1_CR1					(*(volatile unsigned long *)(REG_ADC1_BASE + 0x0004))
#define REG_ADC1_CR2					(*(volatile unsigned long *)(REG_ADC1_BASE + 0x0008))
#define REG_ADC1_SMPR1					(*(volatile unsigned long *)(REG_ADC1_BASE + 0x000C))
#define REG_ADC1_SMPR2					(*(volatile unsigned long *)(REG_ADC1_BASE + 0x0010))
#define REG_ADC1_JOFR1					(*(volatile unsigned long *)(REG_ADC1_BASE + 0x0014))
#define REG_ADC1_JOFR2					(*(volatile unsigned long *)(REG_ADC1_BASE + 0x0018))
#define REG_ADC1_JOFR3					(*(volatile unsigned long *)(REG_ADC1_BASE + 0x001C))
#define REG_ADC1_JOFR4					(*(volatile unsigned long *)(REG_ADC1_BASE + 0x0020))
#define REG_ADC1_HTR					(*(volatile unsigned long *)(REG_ADC1_BASE + 0x0024))
#define REG_ADC1_LTR					(*(volatile unsigned long *)(REG_ADC1_BASE + 0x0028))
#define REG_ADC1_SQR1					(*(volatile unsigned long *)(REG_ADC1_BASE + 0x002C))
#define REG_ADC1_SQR2					(*(volatile unsigned long *)(REG_ADC1_BASE + 0x0030))
#define REG_ADC1_SQR3					(*(volatile unsigned long *)(REG_ADC1_BASE + 0x0034))
#define REG_ADC1_JSQR					(*(volatile unsigned long *)(REG_ADC1_BASE + 0x0038))
#define REG_ADC1_JDR1					(*(volatile unsigned long *)(REG_ADC1_BASE + 0x003C))
#define REG_ADC1_JDR2					(*(volatile unsigned long *)(REG_ADC1_BASE + 0x0040))
#define REG_ADC1_JDR3					(*(volatile unsigned long *)(REG_ADC1_BASE + 0x0044))
#define REG_ADC1_JDR4					(*(volatile unsigned long *)(REG_ADC1_BASE + 0x0048))
#define REG_ADC1_DR						(*(volatile unsigned long *)(REG_ADC1_BASE + 0x004C))



//-- ADC2
//
#define REG_ADC2_BASE					0x40012800
#define REG_ADC2_SR						(*(volatile unsigned long *)(REG_ADC2_BASE + 0x0000))
#define REG_ADC2_CR1					(*(volatile unsigned long *)(REG_ADC2_BASE + 0x0004))
#define REG_ADC2_CR2					(*(volatile unsigned long *)(REG_ADC2_BASE + 0x0008))
#define REG_ADC2_SMPR1					(*(volatile unsigned long *)(REG_ADC2_BASE + 0x000C))
#define REG_ADC2_SMPR2					(*(volatile unsigned long *)(REG_ADC2_BASE + 0x0010))
#define REG_ADC2_JOFR1					(*(volatile unsigned long *)(REG_ADC2_BASE + 0x0014))
#define REG_ADC2_JOFR2					(*(volatile unsigned long *)(REG_ADC2_BASE + 0x0018))
#define REG_ADC2_JOFR3					(*(volatile unsigned long *)(REG_ADC2_BASE + 0x001C))
#define REG_ADC2_JOFR4					(*(volatile unsigned long *)(REG_ADC2_BASE + 0x0020))
#define REG_ADC2_HTR					(*(volatile unsigned long *)(REG_ADC2_BASE + 0x0024))
#define REG_ADC2_LTR					(*(volatile unsigned long *)(REG_ADC2_BASE + 0x0028))
#define REG_ADC2_SQR1					(*(volatile unsigned long *)(REG_ADC2_BASE + 0x002C))
#define REG_ADC2_SQR2					(*(volatile unsigned long *)(REG_ADC2_BASE + 0x0030))
#define REG_ADC2_SQR3					(*(volatile unsigned long *)(REG_ADC2_BASE + 0x0034))
#define REG_ADC2_JSQR					(*(volatile unsigned long *)(REG_ADC2_BASE + 0x0038))
#define REG_ADC2_JDR1					(*(volatile unsigned long *)(REG_ADC2_BASE + 0x003C))
#define REG_ADC2_JDR2					(*(volatile unsigned long *)(REG_ADC2_BASE + 0x0040))
#define REG_ADC2_JDR3					(*(volatile unsigned long *)(REG_ADC2_BASE + 0x0044))
#define REG_ADC2_JDR4					(*(volatile unsigned long *)(REG_ADC2_BASE + 0x0048))
#define REG_ADC2_DR						(*(volatile unsigned long *)(REG_ADC2_BASE + 0x004C))



//-- ADC3
//
#define REG_ADC3_BASE					0x40013C00
#define REG_ADC3_SR						(*(volatile unsigned long *)(REG_ADC3_BASE + 0x0000))
#define REG_ADC3_CR1					(*(volatile unsigned long *)(REG_ADC3_BASE + 0x0004))
#define REG_ADC3_CR2					(*(volatile unsigned long *)(REG_ADC3_BASE + 0x0008))
#define REG_ADC3_SMPR1					(*(volatile unsigned long *)(REG_ADC3_BASE + 0x000C))
#define REG_ADC3_SMPR2					(*(volatile unsigned long *)(REG_ADC3_BASE + 0x0010))
#define REG_ADC3_JOFR1					(*(volatile unsigned long *)(REG_ADC3_BASE + 0x0014))
#define REG_ADC3_JOFR2					(*(volatile unsigned long *)(REG_ADC3_BASE + 0x0018))
#define REG_ADC3_JOFR3					(*(volatile unsigned long *)(REG_ADC3_BASE + 0x001C))
#define REG_ADC3_JOFR4					(*(volatile unsigned long *)(REG_ADC3_BASE + 0x0020))
#define REG_ADC3_HTR					(*(volatile unsigned long *)(REG_ADC3_BASE + 0x0024))
#define REG_ADC3_LTR					(*(volatile unsigned long *)(REG_ADC3_BASE + 0x0028))
#define REG_ADC3_SQR1					(*(volatile unsigned long *)(REG_ADC3_BASE + 0x002C))
#define REG_ADC3_SQR2					(*(volatile unsigned long *)(REG_ADC3_BASE + 0x0030))
#define REG_ADC3_SQR3					(*(volatile unsigned long *)(REG_ADC3_BASE + 0x0034))
#define REG_ADC3_JSQR					(*(volatile unsigned long *)(REG_ADC3_BASE + 0x0038))
#define REG_ADC3_JDR1					(*(volatile unsigned long *)(REG_ADC3_BASE + 0x003C))
#define REG_ADC3_JDR2					(*(volatile unsigned long *)(REG_ADC3_BASE + 0x0040))
#define REG_ADC3_JDR3					(*(volatile unsigned long *)(REG_ADC3_BASE + 0x0044))
#define REG_ADC3_JDR4					(*(volatile unsigned long *)(REG_ADC3_BASE + 0x0048))
#define REG_ADC3_DR						(*(volatile unsigned long *)(REG_ADC3_BASE + 0x004C))



//-- EXTI
//
#define REG_EXTI_BASE					0x40010400
#define REG_EXTI_IMR					(*(volatile unsigned long *)(REG_EXTI_BASE + 0x0000))
#define REG_EXTI_EMR					(*(volatile unsigned long *)(REG_EXTI_BASE + 0x0004))
#define REG_EXIT_RTSR					(*(volatile unsigned long *)(REG_EXTI_BASE + 0x0008))
#define REG_EXIT_FTSR					(*(volatile unsigned long *)(REG_EXTI_BASE + 0x000C))
#define REG_EXIT_SWIER					(*(volatile unsigned long *)(REG_EXTI_BASE + 0x0010))
#define REG_EXIT_PR						(*(volatile unsigned long *)(REG_EXTI_BASE + 0x0014))



//-- Timer1
//
#define REG_TIM1_BASE					0x40012C00
#define REG_TIM1_CR1					(*(volatile unsigned long *)(REG_TIM1_BASE + 0x0000))
#define REG_TIM1_CR2					(*(volatile unsigned long *)(REG_TIM1_BASE + 0x0004))
#define REG_TIM1_SMCR					(*(volatile unsigned long *)(REG_TIM1_BASE + 0x0008))
#define REG_TIM1_DIER					(*(volatile unsigned long *)(REG_TIM1_BASE + 0x000C))
#define REG_TIM1_SR						(*(volatile unsigned long *)(REG_TIM1_BASE + 0x0010))
#define REG_TIM1_EGR					(*(volatile unsigned long *)(REG_TIM1_BASE + 0x0014))
#define REG_TIM1_CCMR1					(*(volatile unsigned long *)(REG_TIM1_BASE + 0x0018))
#define REG_TIM1_CCMR2					(*(volatile unsigned long *)(REG_TIM1_BASE + 0x001C))
#define REG_TIM1_CCER					(*(volatile unsigned long *)(REG_TIM1_BASE + 0x0020))
#define REG_TIM1_CNT					(*(volatile unsigned long *)(REG_TIM1_BASE + 0x0024))
#define REG_TIM1_PSC					(*(volatile unsigned long *)(REG_TIM1_BASE + 0x0028))
#define REG_TIM1_ARR					(*(volatile unsigned long *)(REG_TIM1_BASE + 0x002C))
#define REG_TIM1_RCR					(*(volatile unsigned long *)(REG_TIM1_BASE + 0x0030))
#define REG_TIM1_CCR1					(*(volatile unsigned long *)(REG_TIM1_BASE + 0x0034))
#define REG_TIM1_CCR2					(*(volatile unsigned long *)(REG_TIM1_BASE + 0x0038))
#define REG_TIM1_CCR3					(*(volatile unsigned long *)(REG_TIM1_BASE + 0x003C))
#define REG_TIM1_CCR4					(*(volatile unsigned long *)(REG_TIM1_BASE + 0x0040))
#define REG_TIM1_BDTR					(*(volatile unsigned long *)(REG_TIM1_BASE + 0x0044))
#define REG_TIM1_DCR					(*(volatile unsigned long *)(REG_TIM1_BASE + 0x0048))
#define REG_TIM1_DMAR					(*(volatile unsigned long *)(REG_TIM1_BASE + 0x004C))



//-- Timer2
//
#define REG_TIM2_BASE					0x40000000
#define REG_TIM2_CR1					(*(volatile unsigned long *)(REG_TIM2_BASE + 0x0000))
#define REG_TIM2_CR2					(*(volatile unsigned long *)(REG_TIM2_BASE + 0x0004))
#define REG_TIM2_SMCR					(*(volatile unsigned long *)(REG_TIM2_BASE + 0x0008))
#define REG_TIM2_DIER					(*(volatile unsigned long *)(REG_TIM2_BASE + 0x000C))
#define REG_TIM2_SR						(*(volatile unsigned long *)(REG_TIM2_BASE + 0x0010))
#define REG_TIM2_EGR					(*(volatile unsigned long *)(REG_TIM2_BASE + 0x0014))
#define REG_TIM2_CCMR1					(*(volatile unsigned long *)(REG_TIM2_BASE + 0x0018))
#define REG_TIM2_CCMR2					(*(volatile unsigned long *)(REG_TIM2_BASE + 0x001C))
#define REG_TIM2_CCER					(*(volatile unsigned long *)(REG_TIM2_BASE + 0x0020))
#define REG_TIM2_CNT					(*(volatile unsigned long *)(REG_TIM2_BASE + 0x0024))
#define REG_TIM2_PSC					(*(volatile unsigned long *)(REG_TIM2_BASE + 0x0028))
#define REG_TIM2_ARR					(*(volatile unsigned long *)(REG_TIM2_BASE + 0x002C))
#define REG_TIM2_RCR					(*(volatile unsigned long *)(REG_TIM2_BASE + 0x0030))
#define REG_TIM2_CCR1					(*(volatile unsigned long *)(REG_TIM2_BASE + 0x0034))
#define REG_TIM2_CCR2					(*(volatile unsigned long *)(REG_TIM2_BASE + 0x0038))
#define REG_TIM2_CCR3					(*(volatile unsigned long *)(REG_TIM2_BASE + 0x003C))
#define REG_TIM2_CCR4					(*(volatile unsigned long *)(REG_TIM2_BASE + 0x0040))
#define REG_TIM2_BDTR					(*(volatile unsigned long *)(REG_TIM2_BASE + 0x0044))
#define REG_TIM2_DCR					(*(volatile unsigned long *)(REG_TIM2_BASE + 0x0048))
#define REG_TIM2_DMAR					(*(volatile unsigned long *)(REG_TIM2_BASE + 0x004C))



//-- Timer3
//
#define REG_TIM3_BASE					0x40000400
#define REG_TIM3_CR1					(*(volatile unsigned long *)(REG_TIM3_BASE + 0x0000))
#define REG_TIM3_CR2					(*(volatile unsigned long *)(REG_TIM3_BASE + 0x0004))
#define REG_TIM3_SMCR					(*(volatile unsigned long *)(REG_TIM3_BASE + 0x0008))
#define REG_TIM3_DIER					(*(volatile unsigned long *)(REG_TIM3_BASE + 0x000C))
#define REG_TIM3_SR						(*(volatile unsigned long *)(REG_TIM3_BASE + 0x0010))
#define REG_TIM3_EGR					(*(volatile unsigned long *)(REG_TIM3_BASE + 0x0014))
#define REG_TIM3_CCMR1					(*(volatile unsigned long *)(REG_TIM3_BASE + 0x0018))
#define REG_TIM3_CCMR2					(*(volatile unsigned long *)(REG_TIM3_BASE + 0x001C))
#define REG_TIM3_CCER					(*(volatile unsigned long *)(REG_TIM3_BASE + 0x0020))
#define REG_TIM3_CNT					(*(volatile unsigned long *)(REG_TIM3_BASE + 0x0024))
#define REG_TIM3_PSC					(*(volatile unsigned long *)(REG_TIM3_BASE + 0x0028))
#define REG_TIM3_ARR					(*(volatile unsigned long *)(REG_TIM3_BASE + 0x002C))
#define REG_TIM3_RCR					(*(volatile unsigned long *)(REG_TIM3_BASE + 0x0030))
#define REG_TIM3_CCR1					(*(volatile unsigned long *)(REG_TIM3_BASE + 0x0034))
#define REG_TIM3_CCR2					(*(volatile unsigned long *)(REG_TIM3_BASE + 0x0038))
#define REG_TIM3_CCR3					(*(volatile unsigned long *)(REG_TIM3_BASE + 0x003C))
#define REG_TIM3_CCR4					(*(volatile unsigned long *)(REG_TIM3_BASE + 0x0040))
#define REG_TIM3_BDTR					(*(volatile unsigned long *)(REG_TIM3_BASE + 0x0044))
#define REG_TIM3_DCR					(*(volatile unsigned long *)(REG_TIM3_BASE + 0x0048))
#define REG_TIM3_DMAR					(*(volatile unsigned long *)(REG_TIM3_BASE + 0x004C))



//-- Timer4
//
#define REG_TIM4_BASE					0x40000800
#define REG_TIM4_CR1					(*(volatile unsigned long *)(REG_TIM4_BASE + 0x0000))
#define REG_TIM4_CR2					(*(volatile unsigned long *)(REG_TIM4_BASE + 0x0004))
#define REG_TIM4_SMCR					(*(volatile unsigned long *)(REG_TIM4_BASE + 0x0008))
#define REG_TIM4_DIER					(*(volatile unsigned long *)(REG_TIM4_BASE + 0x000C))
#define REG_TIM4_SR						(*(volatile unsigned long *)(REG_TIM4_BASE + 0x0010))
#define REG_TIM4_EGR					(*(volatile unsigned long *)(REG_TIM4_BASE + 0x0014))
#define REG_TIM4_CCMR1					(*(volatile unsigned long *)(REG_TIM4_BASE + 0x0018))
#define REG_TIM4_CCMR2					(*(volatile unsigned long *)(REG_TIM4_BASE + 0x001C))
#define REG_TIM4_CCER					(*(volatile unsigned long *)(REG_TIM4_BASE + 0x0020))
#define REG_TIM4_CNT					(*(volatile unsigned long *)(REG_TIM4_BASE + 0x0024))
#define REG_TIM4_PSC					(*(volatile unsigned long *)(REG_TIM4_BASE + 0x0028))
#define REG_TIM4_ARR					(*(volatile unsigned long *)(REG_TIM4_BASE + 0x002C))
#define REG_TIM4_RCR					(*(volatile unsigned long *)(REG_TIM4_BASE + 0x0030))
#define REG_TIM4_CCR1					(*(volatile unsigned long *)(REG_TIM4_BASE + 0x0034))
#define REG_TIM4_CCR2					(*(volatile unsigned long *)(REG_TIM4_BASE + 0x0038))
#define REG_TIM4_CCR3					(*(volatile unsigned long *)(REG_TIM4_BASE + 0x003C))
#define REG_TIM4_CCR4					(*(volatile unsigned long *)(REG_TIM4_BASE + 0x0040))
#define REG_TIM4_BDTR					(*(volatile unsigned long *)(REG_TIM4_BASE + 0x0044))
#define REG_TIM4_DCR					(*(volatile unsigned long *)(REG_TIM4_BASE + 0x0048))
#define REG_TIM4_DMAR					(*(volatile unsigned long *)(REG_TIM4_BASE + 0x004C))


#endif






















